In [12]:
import pandas as pd
import numpy as np

s=pd.Series(['A','b','c','D','e','F','g','H','i','j','K','l','M','n','O','p','Q','r','S','t','U','v','W','x','Y','z'])
s

0     A
1     b
2     c
3     D
4     e
5     F
6     g
7     H
8     i
9     j
10    K
11    l
12    M
13    n
14    O
15    p
16    Q
17    r
18    S
19    t
20    U
21    v
22    W
23    x
24    Y
25    z
dtype: object

In [13]:
s.str.lower()

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [14]:
index = pd.Index(['  tang', '   yu    ', '  zhang  ', '  li  ', '  wang  '])
index

Index(['  tang', '   yu    ', '  zhang  ', '  li  ', '  wang  '], dtype='object')

In [15]:
index.str.strip()

Index(['tang', 'yu', 'zhang', 'li', 'wang'], dtype='object')

In [16]:
index.str.lstrip()

Index(['tang', 'yu    ', 'zhang  ', 'li  ', 'wang  '], dtype='object')

In [17]:
index.str.rstrip()

Index(['  tang', '   yu', '  zhang', '  li', '  wang'], dtype='object')

In [20]:
df = pd.DataFrame(np.random.randn(3, 2), columns=[' Column A ', ' Column B '], index=range(3))
df

    Column A    Column B
0    0.252117   -0.362508
1    1.607701    0.300776
2    0.538944   -1.263298

In [21]:
df.columns = df.columns.str.replace('A', 'AA')
df

    Column AA    Column B
0     0.252117   -0.362508
1     1.607701    0.300776
2     0.538944   -1.263298

In [22]:
s=pd.Series(['a_b_c', 'c_d_e', 'f_g_h'])
s

0    a_b_c
1    c_d_e
2    f_g_h
dtype: object

In [23]:
s.str.split('_')

0    [a, b, c]
1    [c, d, e]
2    [f, g, h]
dtype: object

In [24]:
s.str.split('_', expand=True)

   0  1  2
0  a  b  c
1  c  d  e
2  f  g  h

In [26]:
#index
kk = pd.Series(np.arange(5), index= np.arange(5)[::-1], dtype='int64')
kk

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [28]:
kk.isin([1,3,4])

4    False
3     True
2    False
1     True
0     True
dtype: bool

In [30]:
kk2 = pd.Series(np.arange(6), index= pd.MultiIndex.from_product([[0,1],['a','b','c']]))
kk2

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [32]:
kk2.iloc[kk2.index.isin([(1,'a'),(2,'b')])]

1  a    3
dtype: int32

In [33]:
dates = pd.date_range('20171124', periods=8)

In [40]:
df = pd.DataFrame(np.random.randn(8,4), index = dates, columns = ['A','B','C','D'])
df

                   A         B         C         D
2017-11-24  1.261833  0.086975 -0.721464 -2.289301
2017-11-25  0.533864 -1.125181 -0.094735 -0.057045
2017-11-26 -1.587331 -0.502702  0.785247  0.698129
2017-11-27 -0.601592 -0.176253  1.200521  1.103821
2017-11-28  0.345817 -0.055726 -1.535347  0.715401
2017-11-29  0.108373 -0.476911  1.194034  1.081285
2017-11-30  1.932885 -0.696142  0.183867 -2.701963
2017-12-01  0.464314  0.281176 -0.329315 -0.431402

In [42]:
df.where(df<0)

                   A         B         C         D
2017-11-24       NaN       NaN -0.721464 -2.289301
2017-11-25       NaN -1.125181 -0.094735 -0.057045
2017-11-26 -1.587331 -0.502702       NaN       NaN
2017-11-27 -0.601592 -0.176253       NaN       NaN
2017-11-28       NaN -0.055726 -1.535347       NaN
2017-11-29       NaN -0.476911       NaN       NaN
2017-11-30       NaN -0.696142       NaN -2.701963
2017-12-01       NaN       NaN -0.329315 -0.431402

In [43]:
df.where(df<0, -df)

                   A         B         C         D
2017-11-24 -1.261833 -0.086975 -0.721464 -2.289301
2017-11-25 -0.533864 -1.125181 -0.094735 -0.057045
2017-11-26 -1.587331 -0.502702 -0.785247 -0.698129
2017-11-27 -0.601592 -0.176253 -1.200521 -1.103821
2017-11-28 -0.345817 -0.055726 -1.535347 -0.715401
2017-11-29 -0.108373 -0.476911 -1.194034 -1.081285
2017-11-30 -1.932885 -0.696142 -0.183867 -2.701963
2017-12-01 -0.464314 -0.281176 -0.329315 -0.431402

In [45]:
df = pd.DataFrame(np.random.rand(10,3), columns = ['col1','col2','col3'])
df

       col1      col2      col3
0  0.078359  0.894130  0.362554
1  0.910362  0.676911  0.466819
2  0.830234  0.618994  0.205735
3  0.186281  0.449474  0.581630
4  0.038325  0.562645  0.076985
5  0.838005  0.722510  0.186913
6  0.012372  0.155000  0.567455
7  0.560199  0.831270  0.601089
8  0.554030  0.045625  0.892219
9  0.375090  0.770586  0.088385

In [46]:
df.query('col1 > col2')

       col1      col2      col3
1  0.910362  0.676911  0.466819
2  0.830234  0.618994  0.205735
5  0.838005  0.722510  0.186913
8  0.554030  0.045625  0.892219

In [47]:
df.query('col1 > col2 & col1 > col3')

       col1      col2      col3
1  0.910362  0.676911  0.466819
2  0.830234  0.618994  0.205735
5  0.838005  0.722510  0.186913